rails_part/app/controllers/books_controller.rb

  def index # users/:id/books or friends/books to see all of your friends books
    @books = Book.all
---
SELECT "books".* FROM "books"