rails_part/app/controllers/books_controller.rb

SELECT "books".* FROM "books" INNER JOIN "book_users" ON "books"."id" = "book_users"."book_id" WHERE "book_users"."user_id" = 2
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
  def index # users/:id/books or friends/books to see all of your friends books
    @books = User.find(params[:user_id]).books